## Pandas: Series and DataFrame

### Create Series from List

In [1]:
import numpy as np
import pandas as pd

label = ['Bandung', 'BSD', 'Jakarta']
A = [1,2,3]

In [2]:
Z = pd.Series(data=label)
Z

0    Bandung
1        BSD
2    Jakarta
dtype: object

In [3]:
Z = pd.Series(data=A, index=label)
Z

Bandung    1
BSD        2
Jakarta    3
dtype: int64

In [4]:
K = pd.Series(A,label)
K

Bandung    1
BSD        2
Jakarta    3
dtype: int64

In [5]:
K[2]

3

### Create Series from Numpy Array

In [6]:
label = ['Bandung', 'BSD', 'Jakarta']
arr = np.array([100,80,90])

In [7]:
A = pd.Series(arr,label)
A

Bandung    100
BSD         80
Jakarta     90
dtype: int32

### Create Series from Dictionary

In [8]:
d ={'Bandung' : 100, 'BSD' : 90.5, 'Jakarta': 90}

In [9]:
Z = pd.Series(d)
Z

Bandung    100.0
BSD         90.5
Jakarta     90.0
dtype: float64

### Creat DataFrame from List

In [10]:
index = ['a', 'b', 'c']
kolom = ['W', 'X', 'Y', 'Z']
list_numbers = [1,2,3,4], [4,5,6,7], [7,8,9,10]

In [11]:
df1 = pd.DataFrame(list_numbers)
df1

   0  1  2   3
0  1  2  3   4
1  4  5  6   7
2  7  8  9  10

In [13]:
df1 = pd.DataFrame(list_numbers, index=index)
df1

   0  1  2   3
a  1  2  3   4
b  4  5  6   7
c  7  8  9  10

In [15]:
df1 = pd.DataFrame(list_numbers, index=index, columns=kolom)
df1

   W  X  Y   Z
a  1  2  3   4
b  4  5  6   7
c  7  8  9  10

### Create DataFrame from Array

In [16]:
df2 = pd.DataFrame(np.random.randn(5,5))
df2

          0         1         2         3         4
0  0.513697 -0.198708  0.367088  0.970245  1.883775
1 -0.981006  0.760097  1.327624  0.137179  1.574559
2 -0.098585  0.938397  1.096641  0.221478  0.375509
3 -3.080080 -1.837813 -0.577222  0.686384  0.523442
4  0.846695  1.404000  0.474182 -0.101894  0.717128

In [17]:
df2 = pd.DataFrame(np.random.randn(5,5), index='a b c d e'.split())
df2

          0         1         2         3         4
a  2.224035 -1.115557 -0.124683  0.278076 -0.857983
b -0.936202 -1.771020  0.456227 -0.453947 -1.050993
c  1.227345 -0.241929 -1.665432 -1.675694  1.122473
d -2.046898  0.458078  0.277906  0.241946  0.067014
e  1.003956 -0.630190 -1.768511  1.081246 -1.035516

In [18]:
df2 = pd.DataFrame(np.random.randn(5,5), index='a b c d e'.split(), columns='K L M N O'.split())
df2

          K         L         M         N         O
a -0.023411 -0.898267 -0.216912 -0.281814 -1.321046
b  0.265201  1.203643  0.812078  2.399823  2.318072
c  2.419088  1.555409 -0.089831 -1.174156  1.788356
d  1.219234 -1.508086  0.484606  0.838701 -1.280586
e  0.677629  0.278337  1.052913  0.176481  0.577022

### Create DataFrame from Dictionary

In [19]:
d ={'Bandung' : [100], 'BSD' : [90.5], 'Jakarta': [90]}
d

{'Bandung': [100], 'BSD': [90.5], 'Jakarta': [90]}

In [20]:
df3 = pd.DataFrame(d)
df3

   Bandung   BSD  Jakarta
0      100  90.5       90

In [21]:
d ={'Bandung' : [100, 200], 'BSD' : [90.5, 10], 'Jakarta': [90, 88]}
d

{'Bandung': [100, 200], 'BSD': [90.5, 10], 'Jakarta': [90, 88]}

In [22]:
df3 = pd.DataFrame(d, index='a b'.split())
df3

   Bandung   BSD  Jakarta
a      100  90.5       90
b      200  10.0       88

In [23]:
df4 = pd.DataFrame()
df4

Empty DataFrame
Columns: []
Index: []

In [24]:
df4['A'] = np.random.randn(10)
df4

          A
0  0.136267
1  0.221447
2 -1.331890
3 -0.117501
4  0.360988
5 -0.276574
6 -0.526383
7  0.366442
8  0.893229
9  0.053046

## Pandas : Indexing and Selecting Data

In [25]:
df = pd.DataFrame(np.random.randn(5,5))
df

          0         1         2         3         4
0 -1.070017  1.631660 -1.770520  0.516198  0.306082
1 -0.700200 -1.297989 -1.066446  0.360680  0.364210
2  0.375483  1.614070  0.901475 -1.508336 -0.768241
3  1.472214 -0.321859 -0.672245 -0.604884  0.608642
4  1.129586  0.317924  1.135883  1.723947 -1.864740

In [26]:
df[0]

0   -1.070017
1   -0.700200
2    0.375483
3    1.472214
4    1.129586
Name: 0, dtype: float64

In [27]:
df[[0,1]]

          0         1
0 -1.070017  1.631660
1 -0.700200 -1.297989
2  0.375483  1.614070
3  1.472214 -0.321859
4  1.129586  0.317924

In [28]:
df[0][0:2]

0   -1.070017
1   -0.700200
Name: 0, dtype: float64

In [29]:
df[1][2:]

2    1.614070
3   -0.321859
4    0.317924
Name: 1, dtype: float64

In [30]:
df = pd.DataFrame(np.random.randn(5,5), index='A B C D E'.split(), columns='V W X Y Z'.split())
df

          V         W         X         Y         Z
A -0.876318 -0.727197  0.566878  0.803683  0.498479
B -1.273839 -0.223944 -0.482623  0.802064  1.173638
C  0.899983  0.545596 -0.223433  0.284417 -1.737013
D -0.339717 -2.379166  0.986675  0.097892  1.061046
E  1.537329  0.084351  0.762584  0.951443  1.767793

In [31]:
df['W']

A   -0.727197
B   -0.223944
C    0.545596
D   -2.379166
E    0.084351
Name: W, dtype: float64

In [32]:
df['W'][1]

-0.22394442344539525

In [33]:
df['W']['B']

-0.22394442344539525

In [34]:
df['W'][0:3]

A   -0.727197
B   -0.223944
C    0.545596
Name: W, dtype: float64

In [35]:
df[['W','Z']]

          W         Z
A -0.727197  0.498479
B -0.223944  1.173638
C  0.545596 -1.737013
D -2.379166  1.061046
E  0.084351  1.767793

### .loc

In [36]:
df.loc['A']

V   -0.876318
W   -0.727197
X    0.566878
Y    0.803683
Z    0.498479
Name: A, dtype: float64

In [37]:
df.loc['A':'C']

          V         W         X         Y         Z
A -0.876318 -0.727197  0.566878  0.803683  0.498479
B -1.273839 -0.223944 -0.482623  0.802064  1.173638
C  0.899983  0.545596 -0.223433  0.284417 -1.737013

In [38]:
df.loc['C':]

          V         W         X         Y         Z
C  0.899983  0.545596 -0.223433  0.284417 -1.737013
D -0.339717 -2.379166  0.986675  0.097892  1.061046
E  1.537329  0.084351  0.762584  0.951443  1.767793

### .iloc

In [39]:
df.iloc[2]

V    0.899983
W    0.545596
X   -0.223433
Y    0.284417
Z   -1.737013
Name: C, dtype: float64

In [40]:
df.iloc[1:3]

          V         W         X         Y         Z
B -1.273839 -0.223944 -0.482623  0.802064  1.173638
C  0.899983  0.545596 -0.223433  0.284417 -1.737013

In [41]:
df.iloc[3:]

          V         W         X         Y         Z
D -0.339717 -2.379166  0.986675  0.097892  1.061046
E  1.537329  0.084351  0.762584  0.951443  1.767793

In [42]:
df.iloc[0:4:2]

          V         W         X         Y         Z
A -0.876318 -0.727197  0.566878  0.803683  0.498479
C  0.899983  0.545596 -0.223433  0.284417 -1.737013

In [43]:
df.iloc[:, 0:3]

          V         W         X
A -0.876318 -0.727197  0.566878
B -1.273839 -0.223944 -0.482623
C  0.899983  0.545596 -0.223433
D -0.339717 -2.379166  0.986675
E  1.537329  0.084351  0.762584

In [44]:
df.iloc[1:4, 2:4]

          X         Y
B -0.482623  0.802064
C -0.223433  0.284417
D  0.986675  0.097892

In [45]:
df.iloc[2,4]

-1.7370125568068315

In [46]:
df.iloc[[1,3]]

          V         W         X         Y         Z
B -1.273839 -0.223944 -0.482623  0.802064  1.173638
D -0.339717 -2.379166  0.986675  0.097892  1.061046

### Condisional Selection

In [47]:
df

          V         W         X         Y         Z
A -0.876318 -0.727197  0.566878  0.803683  0.498479
B -1.273839 -0.223944 -0.482623  0.802064  1.173638
C  0.899983  0.545596 -0.223433  0.284417 -1.737013
D -0.339717 -2.379166  0.986675  0.097892  1.061046
E  1.537329  0.084351  0.762584  0.951443  1.767793

In [48]:
df>0

       V      W      X     Y      Z
A  False  False   True  True   True
B  False  False  False  True   True
C   True   True  False  True  False
D  False  False   True  True   True
E   True   True   True  True   True

In [49]:
df['W']>0

A    False
B    False
C     True
D    False
E     True
Name: W, dtype: bool

In [50]:
df[df>0]

          V         W         X         Y         Z
A       NaN       NaN  0.566878  0.803683  0.498479
B       NaN       NaN       NaN  0.802064  1.173638
C  0.899983  0.545596       NaN  0.284417       NaN
D       NaN       NaN  0.986675  0.097892  1.061046
E  1.537329  0.084351  0.762584  0.951443  1.767793

In [51]:
df[df['W']>0]

          V         W         X         Y         Z
C  0.899983  0.545596 -0.223433  0.284417 -1.737013
E  1.537329  0.084351  0.762584  0.951443  1.767793

In [52]:
df[df['W']>0]['Y']

C    0.284417
E    0.951443
Name: Y, dtype: float64

In [53]:
df[df['W']>0][['Y','X']]

          Y         X
C  0.284417 -0.223433
E  0.951443  0.762584

## Pandas for DataFrame Manipulation

In [54]:
data = pd.DataFrame(np.random.randint(1,100,(5,5)), index= 'A B C D E'.split(), columns='V W X Y Z'.split())
data

    V   W   X   Y   Z
A   6  61  27  41  97
B   8  64  87  51   5
C  74  23  76  18  14
D  14  56  27  99  33
E  79  35  48   1  49

### Add new row

In [55]:
data.loc['Baru'] = np.random.rand(5)
data

              V          W          X          Y         Z
A      6.000000  61.000000  27.000000  41.000000  97.00000
B      8.000000  64.000000  87.000000  51.000000   5.00000
C     74.000000  23.000000  76.000000  18.000000  14.00000
D     14.000000  56.000000  27.000000  99.000000  33.00000
E     79.000000  35.000000  48.000000   1.000000  49.00000
Baru   0.138574   0.172542   0.685865   0.739385   0.13589

### Add new column

In [56]:
data['new'] = np.random.randn(6)
data

              V          W          X          Y         Z       new
A      6.000000  61.000000  27.000000  41.000000  97.00000  0.129306
B      8.000000  64.000000  87.000000  51.000000   5.00000 -0.191659
C     74.000000  23.000000  76.000000  18.000000  14.00000  1.339108
D     14.000000  56.000000  27.000000  99.000000  33.00000 -0.876325
E     79.000000  35.000000  48.000000   1.000000  49.00000 -2.181105
Baru   0.138574   0.172542   0.685865   0.739385   0.13589  0.563279

### .insert

In [57]:
data.insert(3,'New', np.random.rand(6))
data

              V          W          X       New          Y         Z       new
A      6.000000  61.000000  27.000000  0.482541  41.000000  97.00000  0.129306
B      8.000000  64.000000  87.000000  0.966443  51.000000   5.00000 -0.191659
C     74.000000  23.000000  76.000000  0.095627  18.000000  14.00000  1.339108
D     14.000000  56.000000  27.000000  0.007974  99.000000  33.00000 -0.876325
E     79.000000  35.000000  48.000000  0.439409   1.000000  49.00000 -2.181105
Baru   0.138574   0.172542   0.685865  0.266925   0.739385   0.13589  0.563279

### Delete data

In [58]:
data

              V          W          X       New          Y         Z       new
A      6.000000  61.000000  27.000000  0.482541  41.000000  97.00000  0.129306
B      8.000000  64.000000  87.000000  0.966443  51.000000   5.00000 -0.191659
C     74.000000  23.000000  76.000000  0.095627  18.000000  14.00000  1.339108
D     14.000000  56.000000  27.000000  0.007974  99.000000  33.00000 -0.876325
E     79.000000  35.000000  48.000000  0.439409   1.000000  49.00000 -2.181105
Baru   0.138574   0.172542   0.685865  0.266925   0.739385   0.13589  0.563279

In [59]:
data = pd.DataFrame(np.random.randint(1,100,(5,5)), index= 'A B C D E'.split(), columns='V W X Y Z'.split())
data

    V   W   X   Y   Z
A  16  53  64   1  78
B  19  64  80   2  96
C  12  12  12  28  82
D  86  80  51  75  93
E  93  76  71  10  24

In [60]:
data.drop('Z', axis=1)

    V   W   X   Y
A  16  53  64   1
B  19  64  80   2
C  12  12  12  28
D  86  80  51  75
E  93  76  71  10

In [61]:
data

    V   W   X   Y   Z
A  16  53  64   1  78
B  19  64  80   2  96
C  12  12  12  28  82
D  86  80  51  75  93
E  93  76  71  10  24

In [62]:
data.drop('V', axis=1, inplace=True)

In [63]:
data

    W   X   Y   Z
A  53  64   1  78
B  64  80   2  96
C  12  12  28  82
D  80  51  75  93
E  76  71  10  24

In [64]:
data.drop(['B','D'], axis=0, inplace=True)

In [65]:
data

    W   X   Y   Z
A  53  64   1  78
C  12  12  28  82
E  76  71  10  24

### More About Index

In [66]:
data = pd.DataFrame(np.random.randint(1,100,(5,5)), index= 'A B C D E'.split(), columns='V W X Y Z'.split())
data

    V   W   X   Y   Z
A  99  74   3  27  45
B  40  16  51  10  91
C  60  58  57  44  76
D  93  15  12  45   9
E  73  55  37  73  22

In [67]:
data.reset_index(inplace=True)

In [68]:
data

  index   V   W   X   Y   Z
0     A  99  74   3  27  45
1     B  40  16  51  10  91
2     C  60  58  57  44  76
3     D  93  15  12  45   9
4     E  73  55  37  73  22

In [69]:
data.drop('index', axis=1, inplace=True)
data

    V   W   X   Y   Z
0  99  74   3  27  45
1  40  16  51  10  91
2  60  58  57  44  76
3  93  15  12  45   9
4  73  55  37  73  22

In [70]:
data['IndexBaru'] = 'Jawa Kalimantan Sulawesi Papua Sumaterea'.split()

In [71]:
data

    V   W   X   Y   Z   IndexBaru
0  99  74   3  27  45        Jawa
1  40  16  51  10  91  Kalimantan
2  60  58  57  44  76    Sulawesi
3  93  15  12  45   9       Papua
4  73  55  37  73  22   Sumaterea

In [72]:
data.set_index('IndexBaru', inplace=True)

In [73]:
data

             V   W   X   Y   Z
IndexBaru
Jawa        99  74   3  27  45
Kalimantan  40  16  51  10  91
Sulawesi    60  58  57  44  76
Papua       93  15  12  45   9
Sumaterea   73  55  37  73  22

In [74]:
data[['V', 'Z']]

             V   Z
IndexBaru
Jawa        99  45
Kalimantan  40  91
Sulawesi    60  76
Papua       93   9
Sumaterea   73  22

In [75]:
data.loc['Jawa']

V    99
W    74
X     3
Y    27
Z    45
Name: Jawa, dtype: int32

### Multi Index

In [76]:
Luar = ['Bandung', 'Bandung', 'Bandung', 'Bandung', 'Bandung', 'Bandung',
'Kendari', 'Kendari', 'Kendari', 'Kendari', 'Kendari', 'Kendari',
'Solo', 'Solo', 'Solo', 'Solo', 'Solo', 'Solo']
Dalam = [1,2,3,4,5,6,1,2,3,4,5,6,1,2,3,4,5,6]
index = list(zip(Luar,Dalam))
index

[('Bandung', 1),
 ('Bandung', 2),
 ('Bandung', 3),
 ('Bandung', 4),
 ('Bandung', 5),
 ('Bandung', 6),
 ('Kendari', 1),
 ('Kendari', 2),
 ('Kendari', 3),
 ('Kendari', 4),
 ('Kendari', 5),
 ('Kendari', 6),
 ('Solo', 1),
 ('Solo', 2),
 ('Solo', 3),
 ('Solo', 4),
 ('Solo', 5),
 ('Solo', 6)]

In [77]:
index = pd.MultiIndex.from_tuples(index)
index

MultiIndex([('Bandung', 1),
            ('Bandung', 2),
            ('Bandung', 3),
            ('Bandung', 4),
            ('Bandung', 5),
            ('Bandung', 6),
            ('Kendari', 1),
            ('Kendari', 2),
            ('Kendari', 3),
            ('Kendari', 4),
            ('Kendari', 5),
            ('Kendari', 6),
            (   'Solo', 1),
            (   'Solo', 2),
            (   'Solo', 3),
            (   'Solo', 4),
            (   'Solo', 5),
            (   'Solo', 6)],
           )

In [78]:
df = pd.DataFrame(np.random.randint(1,10,(18,5)), index = index, columns=('Cabang A', 'Cabang B', 'Cabang C', 'Cabang D', 'Cabang E'))

In [79]:
df

           Cabang A  Cabang B  Cabang C  Cabang D  Cabang E
Bandung 1         7         9         8         8         5
        2         3         1         3         2         8
        3         8         8         8         3         6
        4         4         8         8         4         7
        5         1         3         3         5         2
        6         4         8         5         8         1
Kendari 1         4         7         4         1         7
        2         3         8         8         1         7
        3         7         8         8         1         6
        4         3         1         9         5         2
        5         2         2         2         9         1
        6         2         2         7         4         4
Solo    1         7         2         9         6         9
        2         9         1         6         1         7
        3         1         6         4         9         2
        4         5         2         4         7         8
        5         6         7         4         5         6
        6         7         5         8         6         5

In [80]:
df['Cabang A']

Bandung  1    7
         2    3
         3    8
         4    4
         5    1
         6    4
Kendari  1    4
         2    3
         3    7
         4    3
         5    2
         6    2
Solo     1    7
         2    9
         3    1
         4    5
         5    6
         6    7
Name: Cabang A, dtype: int32

In [81]:
df.loc['Kendari']

   Cabang A  Cabang B  Cabang C  Cabang D  Cabang E
1         4         7         4         1         7
2         3         8         8         1         7
3         7         8         8         1         6
4         3         1         9         5         2
5         2         2         2         9         1
6         2         2         7         4         4

In [82]:
df.xs('Bandung')

   Cabang A  Cabang B  Cabang C  Cabang D  Cabang E
1         7         9         8         8         5
2         3         1         3         2         8
3         8         8         8         3         6
4         4         8         8         4         7
5         1         3         3         5         2
6         4         8         5         8         1

In [83]:
df.loc['Solo'].loc[[4,6]]

   Cabang A  Cabang B  Cabang C  Cabang D  Cabang E
4         5         2         4         7         8
6         7         5         8         6         5

In [84]:
df.xs(['Bandung', 3])

C:\Users\User\AppData\Local\Temp/ipykernel_1416/2693536989.py:1: FutureWarning: Passing lists as key for xs is deprecated and will be removed in a future version. Pass key as a tuple instead.
  df.xs(['Bandung', 3])

Cabang A    8
Cabang B    8
Cabang C    8
Cabang D    3
Cabang E    6
Name: (Bandung, 3), dtype: int32

In [85]:
df

           Cabang A  Cabang B  Cabang C  Cabang D  Cabang E
Bandung 1         7         9         8         8         5
        2         3         1         3         2         8
        3         8         8         8         3         6
        4         4         8         8         4         7
        5         1         3         3         5         2
        6         4         8         5         8         1
Kendari 1         4         7         4         1         7
        2         3         8         8         1         7
        3         7         8         8         1         6
        4         3         1         9         5         2
        5         2         2         2         9         1
        6         2         2         7         4         4
Solo    1         7         2         9         6         9
        2         9         1         6         1         7
        3         1         6         4         9         2
        4         5         2         4         7         8
        5         6         7         4         5         6
        6         7         5         8         6         5

In [86]:
df.index.names = ['Kota', 'Lokasi']

In [87]:
df

                Cabang A  Cabang B  Cabang C  Cabang D  Cabang E
Kota    Lokasi
Bandung 1              7         9         8         8         5
        2              3         1         3         2         8
        3              8         8         8         3         6
        4              4         8         8         4         7
        5              1         3         3         5         2
        6              4         8         5         8         1
Kendari 1              4         7         4         1         7
        2              3         8         8         1         7
        3              7         8         8         1         6
        4              3         1         9         5         2
        5              2         2         2         9         1
        6              2         2         7         4         4
Solo    1              7         2         9         6         9
        2              9         1         6         1         7
        3              1         6         4         9         2
        4              5         2         4         7         8
        5              6         7         4         5         6
        6              7         5         8         6         5